<template>
  <div class="gtx">
    <el-row>
      <el-col :span="24">
        <div class="grid-content bg-purple-dark title">
          <h2 style="margin:0px">计算机技术应用在社会发展过程存在的弊端。</h2>
        </div>
      </el-col>
    </el-row>
    <el-divider></el-divider>
    <el-row>
      <el-col :span="24">
        <div class="grid-content bg-purple-dark Abstract">
          摘要：随着我国国民经济的快速发展，计算机已被深入应用到我国的各行各业当中，并在全国范围内广泛普及，也给人们的生活和工作带来非常大的便利，现代社会的发展已越来越离不开计算机的应用。
        </div>
      </el-col>
    </el-row>
    <el-row>
      <el-col :span="24">
        <div class="grid-content bg-purple-dark Abstract">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;笔者首先对计算机应用的现状和存在的问题进行了分析，然后对计算机应用的发展趋势进行了详细的研究，提出了我国未来计算机应用的发展方向。
        </div>
      </el-col>
    </el-row>
    <el-divider></el-divider>
    <el-row>
      <el-col :span="24">
        <div class="grid-content bg-purple-dark Abstract">
          <h3>计算机应用概述</h3>
          <h4>计算机应用的概念</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;计算机应用技术是一门较为边缘的学科，利用计算机快速准确的计算优势，被应用于社会的各行各业中。计算机应用一般分为数值计算领域与非数值应用领域两个方面[1]，这两个领域的发展对科学技术的进步具有非常重要的促进作用。<br>
          <h4>计算机应用存在的问题</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;计算机应用在给人们的生活和工作带来许多便利的同时，也存在诸多的不足。首先，计算机应用技术的水平相对还比较低，相对于国外发达国家，我国计算机应用的普及程度和应用程度还存在很大的不足，我国能充分应用计算机的家庭和企业的数量十分有限，对计算机的使用普遍还停留在非常简单的功能上。所以我国应更多利用计算机技术的快捷和便利的特点，不断进行开发，最终满足更多人群的需求。其次，我国对计算机产业的研发投入力度不够。我国在计算机应用技术软件和硬件方面的投入不足，导致计算机技术无法满足我国重大工程和重要行业的需求，往往依靠国外的计算机信息系统、软件和硬件，这样我国经济的发展就处于极其被动的局面[5]。因此，要提高我国的经济水平，国家可以出台相应的政策，积极发展计算机产业，提高人们的文化素质的同时，加强对计算机应用的重视和研发投入也是非常有必要的。<br>
          <h4>计算机的智能化发展</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;近年来，智能手表、智能电脑和数字电视等高科技产品已普遍出现在人们的日常生活中，并给人们的生活带来了许多便利。这些产品的都应用了计算机的智能化系统的原理，计算机的智能化是模拟人的行为和思想，对其进行研发和设计，制造出一批能够满足人类各种需求的智能产品。这些智能产品有着超出人类的计算和学习推理能力，能够完成人类所不能完成的工作。<br>
          <h4>计算机的微型化发展</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;计算机应用技术的发展过程中，微型化计算机也得到了飞速的发展，给人们的生活带来了许多便利。在人们日常生活中经常使用的家用电器如平板电脑就是计算机微型化的具体体现，这种微型化的电子终端设备比一般的电脑具有更高的性价比，人们携带和使用起来更方便。因此，计算机微型化的发展已成为计算机技术应用的最为主要的发展趋势。<br>
          <h4>计算机的巨型化发展</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;计算机的巨型化是在计算机运算迅速和运算准确的基础上，拥有更为强大的储备功能。计算机的巨型化和微型化存在一个统一的状态中，计算机的微型化是改造计算机的外观，而计算机巨型化是升级计算机的内部性能。巨型化的发展，使得计算机的应用技能更加多样化，能被更广泛使用。例如，巨型化计算机用语系统，应用速度能够达到每秒几百亿次，是计算机应用的一次很大突破。<br>
          <h4>结语</h4>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;总而言之，随着计算机应用技术的广泛使用，人们对计算机的依赖程度越来越高，计算机给人们的生活和工作带来便捷的同时，也大大推动了我国信息化的进程。近年来，我国科学技术发展迅速，计算机技术给许多行业和领域注入更多的活力，对我国的经济建设具有重要的促进作用。因此，应大力发展计算机应用技术，加大对其的资金和技术投入。<br>
        </div>
      </el-col>
    </el-row>
    <el-divider></el-divider>
    <el-row>
      <el-col :span="24">
        <div class="grid-content bg-purple-dark Abstract">
          <h3>参考文献</h3>
          [1]刘妍.计算机智能化图像识别技术的理论性突破[J].数字技术与应用,2013(6):106-107.<br>
          [2]李婷.计算机技术在茶叶生产中的应用探讨[J].福建茶叶，2017(1).<br>
          [3]蒋毅为.浅谈计算机应用的现状与发展趋势[J].教师,2014(32):114-115.<br>
          [4]朗海艳.浅谈计算机应用发展现状和发展趋势[J].中国科技纵览,2012.<br>
          [5]侯晓璐.浅析计算机应用的发展现状及趋势[J].科技创新与应用,2012.<br>
          [6]张华.浅谈计算机应用技术的发展与应用[J].现代农业,2012.<br>
        </div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
export default {

}
</script>

<style>
.title{
  color: black;
  font-size: 20px;
}
.Abstract{
  color: #444;
  font-size: 18px;
  line-height:30px;
}
.gtx{
  text-align: left;
  padding: 30px;
}
</style>